namespace CostNL_3._4.net
{
    //4. Два массива — два противника
    //Ты получил два массива одинаковой длины.
    //Твоя задача — создать третий массив, где каждый элемент равен разнице соответствующих элементов из первого и второго массивов.
    //Если разница меньше нуля, в третий массив помещается 0.
    //Пример:
    //Массив 1: [10, 20, 30]
    //Массив 2: [15, 10, 40]
    //Решение: [0, 10, 0]

    internal class Program
    {
        static void Main(string[] args)
        {

        }
    }
}
